---
kind: property
id: P:Autodesk.Revit.DB.Lighting.InitialColor.TemperatureValue
source: html/1d555cfe-da25-6a9e-cb44-9f8d1977359f.htm
---
# Autodesk.Revit.DB.Lighting.InitialColor.TemperatureValue Property

The light color temperature value in Kelvins.

## Syntax (C#)
```csharp
public double TemperatureValue { get; }
```